DataProcessors/ИнтеграцияZoom.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияZoom</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСервиса</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиВидеоконференций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияТокена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ИнтеграцияZoom/Ext/ManagerModule.bsl
// @Strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт

	НовыеРазрешения = Новый Массив;
	
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	Разрешение = МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTPS",
		"api.zoom.us",
		443,
		НСтр("ru = 'API cервиса организации видеоконференций Zoom (https://api.zoom.us)'"));
	НовыеРазрешения.Добавить(Разрешение);

	ЗапросыРазрешений.Добавить(МодульРаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(НовыеРазрешения));
	
КонецПроцедуры

#Область Интерфейс

// См. ВидеоконференцииВнутренний.ЗаполнитьИспользуемыеСервисы
Процедура ПриЗаполненииИспользуемыхСервисов(ИспользуемыеСервисы, ТолькоНастраиваемые) Экспорт
	
	ИспользуемыеСервисы.Добавить(Сервис());
	
КонецПроцедуры

// См. ВидеоконференцииВнутренний.ЗаполнитьДанныеСервисов
Процедура ПриЗаполненииДанныхСервисов(ДанныеСервисов) Экспорт
	
	ДанныеСервиса = ВидеоконференцииСлужебный.НовыеДанныеСервиса();
	
	ДанныеСервиса.Имя = "Zoom";
	ДанныеСервиса.Представление = НСтр("ru = 'Zoom'");
	ДанныеСервиса.Картинка = БиблиотекаКартинок.ЛоготипZoom;
	ДанныеСервиса.АдресЗапроса = "api.zoom.us";
	ДанныеСервиса.ТребуетсяАвторизацияПользователя = Истина;
	ДанныеСервиса.ВозможнаРаботаСАккаунтомДругогоПользователя = Истина;
	ДанныеСервиса.ДоступноПланирование = Истина;
	ДанныеСервиса.СтартПоСсылке = Истина;
	
	ДанныеСервиса.Авторизация.ПротоколOAuth = Истина;
	
	ИдентификаторПриложения = ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляZoom();
	ДанныеСервиса.Авторизация.СтрокаАвторизацииOAuth =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1?response_type=code&client_id=%2&redirect_uri=%3",
			ИдентификаторПриложения.auth_uri,
			ИдентификаторПриложения.client_id,
			ИдентификаторПриложения.redirect_uri);
	
	ДанныеСервиса.НастройкиОтображения.Кнопки.Перейти.Использование = Истина;
	ДанныеСервиса.НастройкиОтображения.Кнопки.Перейти.Заголовок = НСтр("ru = 'Перейти'");
	
	ДанныеСервиса.НастройкиОтображения.Кнопки.Запланировать.Использование = Истина;
	ДанныеСервиса.НастройкиОтображения.Кнопки.Запланировать.Заголовок = НСтр("ru = 'Запланировать'");
	
	ДанныеСервиса.НастройкиОтображения.Кнопки.Отменить.Использование = Истина;
	ДанныеСервиса.НастройкиОтображения.Кнопки.Отменить.Заголовок = НСтр("ru = 'Отменить'");
	
	ДанныеСервисов.Вставить(Сервис(), ДанныеСервиса);
	
КонецПроцедуры

// См. ВидеоконференцииВнутренний.ЗаполнитьДанныеОДоступностиСервисов
Процедура ПриЗаполненииДанныхОДоступностиСервисов(ДанныеОДоступностиСервисов, УчетныеЗаписи) Экспорт
	
	СервисыУчетныхЗаписей = ВидеоконференцииСлужебный.СервисыУчетныхЗаписей(УчетныеЗаписи);
	
	Для Каждого УчетнаяЗапись Из УчетныеЗаписи Цикл
		Если СервисыУчетныхЗаписей[УчетнаяЗапись] = Сервис() Тогда
			Менеджер = НовыйМенеджер(УчетнаяЗапись);
			
			ДанныеОДоступности = Менеджер.ДанныеОДоступностиСервиса();
			
			ДанныеОДоступностиСервисов.Вставить(УчетнаяЗапись, ДанныеОДоступности);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Результат - См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Код - Строка
Процедура ПриПодключенииУчетнойЗаписи(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Код) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		
		Менеджер = НовыйМенеджер(УчетнаяЗапись);
		
		Результат = Менеджер.Подключить(Код);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  НастройкиВидеоконференции - См. ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции
Процедура ПриСозданииВидеоконференции(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, НастройкиВидеоконференции) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		
		Менеджер = НовыйМенеджер(УчетнаяЗапись);
		
		Результат = Менеджер.СоздатьВидеоконференцию(НастройкиВидеоконференции);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  НастройкиВидеоконференции - См. ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции
Процедура ПриОбновленииВидеоконференции(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, НастройкиВидеоконференции) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		
		Менеджер = НовыйМенеджер(УчетнаяЗапись);
		
		Результат = Менеджер.СоздатьВидеоконференцию(НастройкиВидеоконференции);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
Процедура ПриПолученииДанныхВидеоконференции(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		
		Менеджер = НовыйМенеджер(УчетнаяЗапись);
		
		Результат = Менеджер.ДанныеВидеоконференции(Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
Процедура ПриУдаленииВидеоконференции(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		
		Менеджер = НовыйМенеджер(УчетнаяЗапись);
		
		Результат = Менеджер.УдалитьВидеоконференцию(Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Результат - Булево
//  ОбработкаЗавершена - Булево
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
//  ДанныеПользователя  - См. ВидеоконференцииСлужебный.НовыеДанныеПользователя
Процедура ПриОпределенииПользовательЯвляетсяУчастником(Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя) Экспорт
	
	Если Не ОбработкаЗавершена И Сервис = Сервис() Тогда
		ОбработкаЗавершена = Истина;
		Результат = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Сервис()
	
	Возврат "Zoom";
	
КонецФункции

Функция НовыйМенеджер(УчетнаяЗапись)
	
	Менеджер = Создать();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		РеквизитыУчетнойЗаписи = ВидеоконференцииСлужебный.РеквизитыУчетнойЗаписи(УчетнаяЗапись);
	
		ЗаполнитьЗначенияСвойств(Менеджер, РеквизитыУчетнойЗаписи);
	Иначе
		Менеджер.Сервис = Сервис();
		Менеджер.УчетнаяЗапись = УчетнаяЗапись;
	КонецЕсли;
	
	Менеджер.ДанныеСервиса = Видеоконференции.ДанныеСервиса(Сервис());
	
	Возврат Менеджер;
	
КонецФункции

#КонецОбласти

#КонецЕсли
